Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes.Precision Property
 The precision of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionValuePrecisions Precision { get; set; }
Public Property Precision As DimensionSetBaseAttributes.DimensionValuePrecisions
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionValuePrecisions
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace